In [ ]:
# 7.1 Obsługa brakujacych danych

In [1]:
# NaN - zmiennoprzecinkowa wartość NaN, (nie - liczba),oznaczenie brakującej dane w pakiecie pandas 

import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [2]:
float_data = pd.Series([1.2,-3.5,np.nan,0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
float_data.isna() # True when NaN

0    False
1    False
2     True
3    False
dtype: bool

In [ ]:
# NA - not avaliable, from R language

In [4]:
string_data = pd.Series(['sfsdf',None,np.nan,'sdfdssd 0'])
string_data

0        sfsdf
1         None
2          NaN
3    sdfdssd 0
dtype: object

In [5]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [ ]:
# filtering missing data

In [6]:
data = pd.Series([1,np.nan,3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [7]:
data.dropna() # zwrtaca wartosci inne niz null

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notna()] # the same

0    1.0
2    3.5
4    7.0
dtype: float64

In [2]:
# dataFrames 

data = pd.DataFrame([[1.,6.5,3.],[1.,np.nan,np.nan],[np.nan,np.nan,np.nan,np.nan],[np.nan,6.5,3.]])
data

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [4]:
data.dropna()  # wywali wiersze gdzie jest conajmniej jedna wartosc na

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [6]:
data.dropna(how='all') # tylko jak wszystkie wartosci są all; te funkcje nie modyfikują orginałow, zwracaja nowe obiekty

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [7]:
data.dropna(axis='columns', how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [8]:
data.dropna(axis='columns')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [ ]:
sssss